<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"6b76d989635a55d66f94f60e8ab1f93be55b397219b2c241d0de0fdd5a767f66","plan_job_ref":"Job PR Plan #27 at https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11812942107","plan_out_hash":"ba59d086b49ca89030c81e6bbb4270ac4cfa0d54946f254799502e68eef3390a","plan_hash":"bb0803b7a885f4abdc75c5895f33ba90a80e6c840fcf429d6fb32d4bd19b62bf","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.bar will be created
+   resource "local_file" "bar" {
+       content              = "bar!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./bar.foo"
+       id                   = (known after apply)
    }

  # local_file.foo will be created
+   resource "local_file" "foo" {
+       content              = "foo!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./foo.bar"
+       id                   = (known after apply)
    }

  # local_file.test will be created
+   resource "local_file" "test" {
+       content              = "test"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./test.txt"
+       id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   example_output_homedir = false
```
</details>

:white_check_mark: Plan applied in [Push Apply #7](https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11812952682)
<details open><summary>Outputs</summary>

```hcl
example_output_homedir = false
```
</details>